smrtkrft/SKAPP/esp32/skapp-library/examples/minimal/sdkconfig.defaults
# Minimal SKAPP-Library device defaults.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# USB Serial/JTAG is the default CLI transport in this example.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_USB_SERIAL_JTAG_ENABLED=y
CONFIG_ESP_CONSOLE_HISTORY_BUFFER_SIZE=2048

# Bootloader rollback is handy once sk_ota is added; keep on by default.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# NVS without encryption — fine for dev boards; enable on production.
CONFIG_NVS_ENCRYPTION=n

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
